app/controllers/directors_controller.rb

SELECT * FROM `directors`
---
  def index
    @directors = Director.all