app/controllers/forums_controller.rb

  def index
    @forums = Forum.all
---
SELECT * FROM `forums`

  def show
    @forum = Forum.find(params[:id], :include => :topics)
---
SELECT * FROM `forums` WHERE (`forums`.`id` = 1)
SELECT `topics`.* FROM `topics` WHERE (`topics`.forum_id = 1)

  def edit
    @forum = Forum.find(params[:id])
---
SELECT * FROM `forums` WHERE (`forums`.`id` = 1)

  def create
    @forum = Forum.new(params[:forum])

    respond_to do |format|
      if @forum.save
---
INSERT INTO `forums` (`name`, `updated_at`, `topics_count`, `description`, `replies_count`, `created_at`) VALUES('刘亦应', '2011-04-08 14:28:43', 0, '瞎搞的', 0, '2011-04-08 14:28:43')