app/controllers/photos_controller.rb

SELECT * FROM `photos` ORDER BY created_at DESC LIMIT 0, 3
SELECT count(*) AS count_all FROM `photos`
---
  def index
    # @photos = Photo.all
    @photos = Photo.paginate(:page => params[:page],
      :per_page => params[:pre_page] || 5,
      :include => :user,
      # :conditions => "published = true",
      :order=>"created_at DESC")

SELECT DISTINCT photos.* FROM `photos` INNER JOIN taggings photos_taggings ON photos_taggings.taggable_id = photos.id AND photos_taggings.taggable_type = 'Photo' INNER JOIN tags photos_tags ON photos_tags.id = photos_taggings.tag_id WHERE ((photos_tags.name LIKE 'rails'))
---
  def tag
    @photos= Photo.find_tagged_with(params[:id])
    @cc = @photos.paginate(:page => params[:page],
      :per_page => params[:pre_page] || 5,
      :include => :user,
      # :conditions => "published = true",
      :order=>"created_at DESC")

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
SELECT * FROM `photos` ORDER BY created_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `photos`
---
  def show
    @photo = Photo.find(params[:id])
    @photos = Photo.paginate(:page => params[:page],
      :per_page => params[:pre_page] || 15,
      :include => :user,
      # :conditions => "published = true",
      :order=>"created_at DESC")

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
---
  def edit
    @photo = Photo.find(params[:id])

INSERT INTO `photos` (`image_file_size`, `updated_at`, `screenwrite`, `title`, `language`, `director_id`, `image_content_type`, `image_remote_url`, `country_id`, `description`, `length`, `starring`, `is_avatar`, `user_id`, `published_at`, `image_updated_at`, `created_at`, `image_file_name`) VALUES(40056, '2011-04-19 05:34:59', '', '', '', NULL, 'image/jpeg', NULL, NULL, '', NULL, '', 0, NULL, '2011-04-19 05:34:00', '2011-04-19 05:34:48', '2011-04-19 05:34:59', 'user.bar.jpg')
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
UPDATE `photos` SET `starring` = '动画 / 冒险 / 喜剧 / 家庭', `title` = '里约大冒险 Rio (2011)', `length` = 120, `published_at` = '2011-04-15 08:11:00', `screenwrite` = '鹦鹉莱欧', `description` = '二十世纪福斯《里约大冒险》豆瓣小站：http://site.douban.com/foxmovies/\r\n　　影片讲述一只明尼苏达州小镇上的金刚鹦鹉，一直认为自己是世界上仅存的一只金刚鹦鹉。一天他得知里约热内卢还有另外一只金刚鹦鹉，并且还是一只雌性金刚鹦鹉，他便决定离开家乡，前往巴西的里约热内卢。冒险就这么开始了……', `language` = '英语', `updated_at` = '2011-04-15 04:11:53' WHERE `id` = 8
---
  def update
    @photo = Photo.find(params[:id])
    if @photo.update_attributes(params[:photo])

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
DELETE FROM `photos` WHERE `id` = 1
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy