app/controllers/replies_controller.rb

  def create
    @forum = @topic.forum
    @reply = @topic.replies.build(params[:reply])

    respond_to do |format|
      if @reply.save
---
INSERT INTO `replies` (`topic_id`, `updated_at`, `title`, `body`, `forum_id`, `created_at`) VALUES(1, '2011-04-08 14:44:46', '...', '........', NULL, '2011-04-08 14:44:46')

 def load_topic
  @topic = Topic.find(params[:topic_id])
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 1)