app/controllers/search_controller.rb

  def index
    @class = params[:class] || "topic"
    @query = params[:query] || ''
    unless @query.blank?
      if @class == "topic"
        results = Topic.find_with_ferret @query
---
SELECT * FROM `topics` WHERE (topics.id in ('1'))