app/controllers/topics_controller.rb

SELECT * FROM `topics` WHERE (`topics`.`id` = 0)
SELECT * FROM `replies` WHERE (`replies`.topic_id = 1) LIMIT 0, 20
---
  def show
    @topic = Topic.find(params[:id])
    @replies = @topic.replies.paginate :page => params[:page] || 1,:per_page=> 20

INSERT INTO `topics` (`hits`, `updated_at`, `title`, `body`, `replies_count`, `forum_id`, `sticky`, `created_at`) VALUES(0, '2011-04-08 14:43:46', 'rails之上', '从Rails 2.3.5 升级到 Rails 3.0 beta\r\n因为有一个新的项目打算使用Rails 3.0 beta,所以先试试从Rails 2.3.5升级到Rails 3.0 beta. 请参考官方的release note http://guides.rails.info/3_0_release_notes.html JavaEye也有一篇介绍Rails 3的 http://www.javaeye.com/topic/591833 首先要安装Rails 3 ...', 0, 1, 0, '2011-04-08 14:43:46')
---
  def create
    @topic = Topic.new(params[:topic])
    respond_to do |format|
      if @topic.save