app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('', 'af2f3d6ce5e4408715f79a75d21019c3b9128add', '2011-04-01 16:56:09', 'ab8b617b915bc483749f7c1d6c098fc977a3ca54', NULL, NULL, 'fireflyman', 'yangxiwenhuai@gmail.com', '2011-04-01 16:56:09')